{
  "cough": "You might have a cold or a respiratory infection. Please consult a healthcare professional.",
  "fever": "You might have an infection. Please consult a healthcare professional.",
  "headache": "This could indicate a tension headache. Rest and consult a doctor if it persists.",
  "nausea": "This could indicate gastrointestinal issues. Stay hydrated and consult a doctor if it persists.",
  "sore throat": "You might have a throat infection. Stay hydrated and consider visiting a doctor.",
  "fatigue": "This could be due to various conditions. Consult a healthcare professional for a proper diagnosis.",
  "body aches": "These could be symptoms of a viral infection. Rest and drink plenty of fluids.",
  "chest pain": "This could indicate a heart condition. Seek emergency medical attention.",
  "shortness of breath": "This could indicate a respiratory or heart condition. Seek medical attention.",
  "abdominal pain": "This could indicate gastrointestinal issues. Consult a healthcare professional.",
  "diarrhea": "You might have gastroenteritis. Stay hydrated and consult a doctor if symptoms persist.",
  "back pain": "This could indicate a musculoskeletal issue. Consult a healthcare professional.",
  "joint pain": "This could indicate arthritis. Consult a healthcare professional for proper diagnosis.",
  "rash": "This could indicate an allergic reaction or skin condition. Consult a doctor.",
  "itching": "This could indicate an allergic reaction or skin condition. Consult a doctor.",
  "weight loss": "This could indicate a serious condition. Consult a healthcare professional.",
  "dry mouth": "This could indicate dehydration or a medical condition. Consult a doctor.",
  "increased thirst": "This could indicate diabetes. Consult a healthcare professional.",
  "frequent urination": "This could indicate diabetes or a urinary tract infection. Consult a doctor.",
  "palpitations": "This could indicate a heart condition. Seek medical attention.",
  "dizziness": "This could indicate a neurological or inner ear condition. Consult a doctor.",
  "vomiting": "This could indicate food poisoning or gastrointestinal issues. Stay hydrated and consult a doctor.",
  "chills": "This could indicate an infection. Consult a healthcare professional.",
  "stiff neck": "This could indicate meningitis. Seek emergency medical attention.",
  "persistent cough": "This could indicate a respiratory infection. Consult a healthcare professional.",
  "blood in sputum": "This could indicate a serious condition. Consult a doctor.",
  "sudden weakness": "This could indicate a stroke. Seek emergency medical attention immediately.",
  "slurred speech": "This could indicate a stroke. Seek emergency medical attention immediately.",
  "unexplained bruising": "This could indicate a blood disorder. Consult a healthcare professional.",
  "bleeding": "This could indicate a serious condition. Consult a healthcare professional.",
  "paleness": "This could indicate anemia. Consult a healthcare professional.",
  "night sweats": "This could indicate an underlying infection or condition. Consult a healthcare professional.",
  "chronic diarrhea": "This could indicate Crohn's disease. Consult a healthcare professional.",
  "painful urination": "This could indicate a urinary tract infection. Consult a healthcare professional.",
  "cloudy urine": "This could indicate a urinary tract infection. Consult a healthcare professional.",
  "numbness": "This could indicate a neurological condition. Consult a healthcare professional.",
  "tingling": "This could indicate a neurological condition. Consult a healthcare professional.",
  "wheezing": "This could indicate asthma. Consult a healthcare professional.",
  "vision changes": "This could indicate a serious condition. Consult a healthcare professional.",
  "depression": "This could indicate a mental health condition. Consult a healthcare professional.",
  "cold intolerance": "This could indicate hypothyroidism. Consult a healthcare professional.",
  "hair loss": "This could indicate a hormonal imbalance. Consult a healthcare professional.",
  "dry skin": "This could indicate a skin condition or hypothyroidism. Consult a healthcare professional.",
  "weight gain": "This could indicate hypothyroidism. Consult a healthcare professional.",
  "slow healing": "This could indicate diabetes. Consult a healthcare professional.",
  "bloating": "This could indicate irritable bowel syndrome. Consult a healthcare professional.",
  "muscle pain": "This could indicate fibromyalgia. Consult a healthcare professional.",
  "swollen glands": "This could indicate an infection. Consult a healthcare professional.",
  "abdominal cramping": "This could indicate a gastrointestinal condition. Consult a healthcare professional.",
  "high fever": "This could indicate a serious infection. Seek emergency medical attention.",
  "cough, fever": "You might have the flu. Please consult a healthcare professional.",
  "headache, nausea": "These symptoms could indicate a migraine. Rest in a dark room and consult your doctor if it persists.",
  "cough, fever, shortness of breath": "These symptoms are concerning for COVID-19. Seek immediate medical attention.",
  "sore throat, fever": "You might have a throat infection. Stay hydrated and consider visiting a doctor.",
  "fatigue, body aches": "These could be symptoms of a viral infection. Rest and drink plenty of fluids.",
  "chest pain, shortness of breath": "These symptoms could indicate a heart attack. Seek emergency medical attention.",
  "abdominal pain, diarrhea": "You might have gastroenteritis. Stay hydrated and consult a healthcare professional if symptoms persist.",
  "back pain, fever": "These symptoms could indicate a kidney infection. Seek medical advice.",
  "joint pain, swelling": "These symptoms could indicate arthritis. Consult a healthcare professional for proper diagnosis and treatment.",
  "rash, itching": "These symptoms could indicate an allergic reaction or skin condition. Consult a healthcare professional for proper diagnosis.",
  "weight loss, fatigue": "These symptoms could indicate diabetes. Consult a healthcare professional for testing and diagnosis.",
  "dry mouth, increased thirst": "These symptoms could indicate diabetes. Consult a healthcare professional for testing and diagnosis.",
  "frequent urination, increased hunger": "These symptoms could indicate diabetes. Consult a healthcare professional for testing and diagnosis.",
  "chest pain, palpitations": "These symptoms could indicate a heart condition. Seek emergency medical attention.",
  "dizziness, blurred vision": "These symptoms could indicate a neurological condition. Consult a healthcare professional for proper diagnosis.",
  "nausea, vomiting": "These symptoms could indicate food poisoning or gastrointestinal issues. Stay hydrated and consult a healthcare professional if symptoms persist.",
  "fever, chills": "These symptoms could indicate an infection. Consult a healthcare professional for proper diagnosis and treatment.",
  "headache, stiff neck": "These symptoms could indicate meningitis. Seek emergency medical attention.",
  "persistent cough, blood in sputum": "These symptoms could indicate tuberculosis. Consult a healthcare professional for testing and diagnosis.",
  "sudden weakness, slurred speech": "These symptoms could indicate a stroke. Seek emergency medical attention immediately.",
  "unexplained bruising, bleeding": "These symptoms could indicate a blood disorder. Consult a healthcare professional for proper diagnosis.",
  "extreme fatigue, paleness": "These symptoms could indicate anemia. Consult a healthcare professional for testing and diagnosis.",
  "persistent fever, night sweats": "These symptoms could indicate an underlying infection or condition. Consult a healthcare professional for proper diagnosis.",
  "chronic diarrhea, weight loss": "These symptoms could indicate Crohn's disease. Consult a healthcare professional for proper diagnosis and treatment.",
  "painful urination, cloudy urine": "These symptoms could indicate a urinary tract infection. Consult a healthcare professional for testing and treatment.",
  "numbness, tingling": "These symptoms could indicate a neurological condition or vitamin deficiency. Consult a healthcare professional for proper diagnosis.",
  "shortness of breath, wheezing": "These symptoms could indicate asthma. Consult a healthcare professional for proper diagnosis and treatment.",
  "persistent headache, vision changes": "These symptoms could indicate a brain tumor. Consult a healthcare professional for testing and diagnosis.",
  "fatigue, depression": "These symptoms could indicate hypothyroidism. Consult a healthcare professional for testing and treatment.",
  "weight gain, cold intolerance": "These symptoms could indicate hypothyroidism. Consult a healthcare professional for testing and treatment.",
  "hair loss, dry skin": "These symptoms could indicate hypothyroidism. Consult a healthcare professional for testing and treatment.",
  "persistent cough, weight loss": "These symptoms could indicate lung cancer. Consult a healthcare professional for testing and diagnosis.",
  "fever, joint pain": "These symptoms could indicate dengue fever. Seek medical attention.",
  "yellowing of skin, abdominal pain": "These symptoms could indicate hepatitis. Consult a healthcare professional for testing and treatment.",
  "sudden severe headache, nausea": "These symptoms could indicate a migraine or a more serious condition. Consult a healthcare professional.",
  "unexplained weight loss, fatigue": "These symptoms could indicate cancer. Consult a healthcare professional for testing and diagnosis.",
  "sore throat, difficulty swallowing": "These symptoms could indicate strep throat. Consult a healthcare professional for testing and treatment.",
  "persistent fever, cough": "These symptoms could indicate pneumonia. Seek medical attention.",
  "muscle pain, fatigue": "These symptoms could indicate fibromyalgia. Consult a healthcare professional for proper diagnosis and treatment.",
  "frequent infections, slow healing": "These symptoms could indicate an immune deficiency. Consult a healthcare professional for testing and diagnosis.",
  "persistent diarrhea, bloating": "These symptoms could indicate irritable bowel syndrome. Consult a healthcare professional for proper diagnosis and treatment.",
  "chronic fatigue, joint pain": "These symptoms could indicate chronic fatigue syndrome. Consult a healthcare professional for proper diagnosis and treatment.",
  "fever, swollen glands": "These symptoms could indicate mononucleosis. Consult a healthcare professional for proper diagnosis and treatment.",
  "abdominal pain, bloating": "These symptoms could indicate appendicitis. Seek emergency medical attention.",
  "persistent pain, abdominal cramping": "These symptoms could indicate endometriosis. Consult a healthcare professional for proper diagnosis and treatment.",
  "severe headache, high fever": "These symptoms could indicate encephalitis. Seek emergency medical attention.",
  "fever, chills, body aches": "These symptoms could indicate malaria. Seek medical attention.",
  "rash, joint pain, fever": "These symptoms could indicate chikungunya. Seek medical attention.",
  "cough, night sweats, weight loss": "These symptoms could indicate tuberculosis. Consult a healthcare professional for testing and diagnosis.",
  "blurred vision, eye pain": "These symptoms could indicate glaucoma. Consult an eye specialist for proper diagnosis and treatment."
}
